; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v8 ?v5)
		(pred_6 ?v1)
		(pred_3 ?v2)
		(pred_1 ?v2)
		(pred_5 ?v1 ?v2)
		(pred_2)
		(pred_4 ?v1))

   (:action op_2
       :parameters  (?v4 ?v7)
       :precondition (and (not-eq ?v4 ?v7) 
                          (pred_3 ?v4) (pred_3 ?v7) (pred_1 ?v4))
       :effect (and  (pred_1 ?v7)
		     (not (pred_1 ?v4))))


   (:action op_1
       :parameters (?v3 ?v6)
       :precondition  (and  (pred_6 ?v3) (pred_3 ?v6)
			    (pred_5 ?v3 ?v6) (pred_1 ?v6) (pred_2))
       :effect (and (pred_4 ?v3)
		    (not (pred_5 ?v3 ?v6)) 
		    (not (pred_2))))

   (:action op_3
       :parameters  (?v3  ?v6)
       :precondition  (and  (pred_6 ?v3) (pred_3 ?v6)
			    (pred_4 ?v3) (pred_1 ?v6))
       :effect (and (pred_5 ?v3 ?v6)
		    (pred_2)
		    (not (pred_4 ?v3)))))

; problem
(define (problem ferry-l3-c3)
(:domain ferry)
(:objects obj_03 obj_04 obj_02 
          obj_05 obj_06 obj_01 
)
(:init
(pred_3 obj_03)
(pred_3 obj_04)
(pred_3 obj_02)
(pred_6 obj_05)
(pred_6 obj_06)
(pred_6 obj_01)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(pred_2)
(pred_5 obj_05 obj_03)
(pred_5 obj_06 obj_03)
(pred_5 obj_01 obj_02)
(pred_1 obj_03)
)
(:goal
(and
(pred_5 obj_05 obj_03)
(pred_5 obj_06 obj_03)
(pred_5 obj_01 obj_03)
)
)

(:constraints
  (sometime-before  (pred_5 obj_01 obj_03) (pred_1 obj_04))
)
)

; plan
1. (op_2 obj_03 obj_02)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_02)
   goals met: 2 of 3
2. (op_1 obj_01 obj_02)
   deleted: (pred_5 obj_01 obj_02) (pred_2)
   added: (pred_4 obj_01)
   goals met: 2 of 3
3. (op_2 obj_02 obj_04)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_04)
   goals met: 2 of 3
4. (op_3 obj_01 obj_04)
   deleted: (pred_4 obj_01)
   added: (pred_5 obj_01 obj_04) (pred_2)
   goals met: 2 of 3
5. (op_2 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 2 of 3
6. (op_1 obj_05 obj_03)
   deleted: (pred_5 obj_05 obj_03) (pred_2)
   added: (pred_4 obj_05)
   goals met: 1 of 3
7. (op_2 obj_03 obj_04)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_04)
   goals met: 1 of 3
8. (op_3 obj_05 obj_04)
   deleted: (pred_4 obj_05)
   added: (pred_5 obj_05 obj_04) (pred_2)
   goals met: 1 of 3
9. (op_1 obj_01 obj_04)
   deleted: (pred_5 obj_01 obj_04) (pred_2)
   added: (pred_4 obj_01)
   goals met: 1 of 3
10. (op_2 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 1 of 3
11. (op_3 obj_01 obj_03)
   deleted: (pred_4 obj_01)
   added: (pred_5 obj_01 obj_03) (pred_2)
   goals met: 2 of 3
12. (op_2 obj_03 obj_04)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_04)
   goals met: 2 of 3
13. (op_1 obj_05 obj_04)
   deleted: (pred_5 obj_05 obj_04) (pred_2)
   added: (pred_4 obj_05)
   goals met: 2 of 3
14. (op_2 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 2 of 3
15. (op_3 obj_05 obj_03)
   deleted: (pred_4 obj_05)
   added: (pred_5 obj_05 obj_03) (pred_2)
   goals met: 3 of 3
